# Pandas üêº

In [129]:
import pandas as pd
import numpy as np
import datetime

## 1. Introdu√ß√£o

1. Series: um nome diferente para coluna, √© um array que armazena todos os valores de uma coluna em uma tabela.
2. Dataframe: uma estrutura de dados que armazena dados em colunas(series) e linhas.


| Opera√ß√£o | Descri√ß√£o |
| :- | :- |
| dataframe.head() | Mostra as linhas do topo de uma tabela | 
| dataframe.tail()| Mostra as linhas do final de uma tabela | 
| dataframe.index | Mostra o index de cada series(linha) da tabela | 
| dataframe.columns | Mostra o index de cada coluna da tabela | 
| dataframe.describe() | Mostra um resumo estat√≠stoc dos seus dados |
| dataframe.sort_values(by="B") | Ordena o dataframe com base nos valores da coluna ou linha definida |
| dataframe.info() | Mostra o tipo de dado, o n√∫mero de linhas, de colunas e de valores n√£o nulos | 
| dataframef.memory_usage() | Mostra o uso de mem√≥ria de cada coluna de um dataframe | 
| Valores exclusivos | No pandas, valores exclusivos se referem √† elementos √∫nicos presentes em uma serie ou coluna |
| dataframe["col2"].unique() | Mostra um array com os elementos √∫nicos da coluna | 
| dataframe["col2"].nunique() | Mostra a quantidade de elementos √∫nicos da coluna | 
| dataframe["col2"].value_counts() | Mostra a quantidade de vezes que cada um dos elementos aparece na coluna |
| df["col1"].sum() | Mostra a soma dos valores da coluna selecionada |
| df["col1"].mean() | Mostra a m√©dia dos valores da coluna selecionada |
| df["col1"].product() | Mostra o resultado da multiplica√ß√£o de todos os valores da coluna (produto) |
| df["col1"].std() | Mostra o desvio padr√£o dos valores da coluna | 
| df["col1"].max() | Mostra o maior valor da coluna | 
| df["col1"].min() | Mostra o menor valor da coluna |
| df["col1"].idxmax() | Mostra o index do maior valor da coluna |
| df["col1"].idxmin() | Mostra o id do menor valor da coluna |
| df[df["col2"] == 444] |Retorna um dataframe contendo apenas as series cujos valores da col2 √© igual √† 444 | 
| df[df["col2"] == 444]["col1"].sum() | Retorna a soma dos valores de col1 quando o  dataframe tem apenas as series valores da col2 √© igual √† 444 |
| serie = pd.Series([1, 2, 3, 4, 5]) | Cria uma serie com os valores que est√£o na lista | 
| pd.Series(minha_lista_string) | Cria uma serie a partir de uma lista previamente definida |
| pd.Series(data=minha_lista_string, index=minha_lista_number) | Cria uma serie com valor e index, com estes tendo sido previamente definidos em uma vari√°vel |
| pd.Series(meu_dicionario) | Cria uma serie a partir de um dicion√°rio, na qual a key ser√° o index e o value ser√° o dado |
| serie1 + serie2  | A soma de duas series √© poss√≠vel quando os indexes s√£o igual, quando n√£o s√£o, a soma retorna NAN |
| serie1[["index"]] | Acessando uma c√©lula da serie pelo seu index | 
| serie1[["index1", "index2"]] | acessando duas c√©lulas da serie pelos seus indexes | 
| dataframe["serie"] | Selecionando uma serie do dataframe |
| dataframe[["serie"]] | Selecionando uma serie do dataframe e deixando ela no formato dataframe | 
| dataframe[["serie1", "serie2"]] | Sele√ß√£o de m√∫ltiplas series no formato dataframe |
| dataframe["new_serie"] = dataframe["serie"] | Cria√ß√£o de uma serie que √© a c√≥pia de uma serie j√° existente |
| dataframe["serie_sum"] = dataframe["serie1"] + dataframe["serie2"] | Cria√ß√£o de uma serie que √© a soma de outras duas |
| dataframe.drop("serie", axis=1) | Remo√ß√£o de uma serie vertical pelo seu nome no dataframe |
| dataframe.drop("serie", axis=1, inplace=True) | Remo√ß√£o de uma serie vertical pelo seu nome no dataframe de maneira permanente |
| dataframe.loc["A"] | Busca linha(s) cujo √≠ndice √© exatamente "A" | 
| dataframe.loc[["A"]] | Busca linha(s) cujo √≠ndice √© exatamente "A" e retorna um dataframe |
| dataframe.loc[["A", "B"]] | Busca linhas cujo √≠ndice √© exatamente "A" ou "B" e retorna um dataframe | 
| dataframe.loc[["A", "B"], ["Z", "new"]] | Busca linhas cujo √≠ndice √© exatamente "A" ou "B" e que est√£o nas colunas "Z" ou "new" e retorna um dataframe | 
| .loc[] | O loc √© uma ferramenta usada para encontrar dados a partir do nome das linhas e/ou colunas | 
| iloc[] | O iloc √© uma ferramenta usada para encontar dados a partir do index das linhas e/ou colunas |
| dataframe.iloc[3, 2] | retorna a c√©lula que est√° na linha 3, coluna 2 |
| dataframe.iloc[:-1, :] | retorna as c√©lulas de todas as linhas menos a √∫ltima e de todas as colunas | 
| dataframe.index | Retorna os indexes da tabela da tabela e o seu tipo | 
| dataframe.columns | Retorna as todas as colunas e o seu tipo | 
| dataframe.reset_index() | Transforma o √≠ndice atual da tabela em coluna e cria um novo √≠ndice come√ßando do 0 | 
| dataframe.set_index("index") | Transforma uma coluna comum no √≠ndice da tabela |
| dataframe.reset_index().set_index("index") | Transforma o √≠ndice em uma coluna e imediatamente pega essa coluna e transforma em √≠ndice de novo |
| dataframe.dropna() | Remove todas as linhas que tem pelo menos um NAN |
| dataframe.dropna(axis=1) | Remove todas as colunas que tem pelo menos um NAN | 
| dataframe.dropna(axis=1, thresh=2) | Remove todas as colunas que t√™m, no m√≠nimmo, dois NAN | 
| dataframe.fillna("Valor") | Substitui todos os valores NAN da tabela por "Valor" |
| dataframe["A"].fillna(value=dataframe["A"].mean()) | Substitui todos o valores NAN da coluna "A" pela m√©dia aritm√©tica dessa mesma coluna |  
| dataframe.ffill() | Preenche valores NAN pelo valor v√°lido anterior | 
| dataframe.bfill() | Preenche os valores NAN pelo pr√≥ximo valor v√°lido | 
| data.groupby("Classe")["Venda"].sum() | Cria um agrupamento simples para saber o total de vendas de cada classe | 
| data.groupby("Classe").sum(numeric_only=True) | Cria um agrupamento simples por classe e soma todas as colunas num√©ricas agrupadas |
| data.groupby("Classe").min() | Cria um agrupamento simples por classe e retorna o valor m√≠nimo de cada coluna |
| data.groupby("Classe").mean(numeric_only=True) | Cria um agrupamento simples e retorna a m√©dia de todas as colunas num√©ricas |
| df2 = df1.copy() | Faz uma c√≥pia do df1 e armazena no df2 |
| df3 = pd.concat([df1, df2]) | Cria um df3 que √© o resultado da concatena√ß√£o vertical do df1 e do df2 | 
| df3 = pd.concat([df1, df1], axis=1) | Cria um df3 que √© o resultado da concatena√ß√£o horizontal do df1 e do df2 |
| dataframe2.groupby(["Classe", "Nome"]).min() | Cria um agrupamento em dois n√≠veis, primeiro agrupa por classe e dentro dela cria subgrupos agrupados por nome para ent√£o o valor m√≠nimo das colunas num√©ricas | 
| pd.merge(esquerda, direita, on="key") | Cruza ou combina duas tabelas diferentes com base em uma coluna comum, a key |

## 2. Series

### 1. Criando diferentes estruturas de dados

In [2]:
minha_lista_string = ['a', 'b', 'c']
minha_lista_number = [10, 20, 30]
meu_array = np.array([10, 20, 30])
meu_dicionario = {'a':10, 'b': 20, 'c':30}

### 2. Criando uma serie pura

In [3]:
serie = pd.Series([1, 2, 3, 4, 5])

In [4]:
serie

0    1
1    2
2    3
3    4
4    5
dtype: int64

### 3. Criando uma serie com uma lista

In [5]:
pd.Series(minha_lista_string)

0    a
1    b
2    c
dtype: str

### 4. Criando uma serie definindo argumentos¬∂

In [6]:
pd.Series(data=minha_lista_string, index=minha_lista_number)

10    a
20    b
30    c
dtype: str

In [7]:
pd.Series(minha_lista_string, minha_lista_number)

10    a
20    b
30    c
dtype: str

### 5. Criando uma serie com um dicion√°rio¬∂

In [9]:
pd.Series(meu_dicionario)

a    10
b    20
c    30
dtype: int64

### 6. Criando series e somando

In [10]:
serie1 = pd.Series([1, 2, 3, 4], index=["Brasil", "Tail√¢ndia", "Isl√¢ndia", "Nepal"])

In [11]:
serie2 = pd.Series([1, 2, 3, 4], index=["Brasil", "Tail√¢ndia", "Isl√¢ndia", "Groenl√¢ndia"])

In [12]:
serie1

Brasil       1
Tail√¢ndia    2
Isl√¢ndia     3
Nepal        4
dtype: int64

In [13]:
serie1 + serie2

Brasil         2.0
Groenl√¢ndia    NaN
Isl√¢ndia       6.0
Nepal          NaN
Tail√¢ndia      4.0
dtype: float64

### 7. Acessando uma celula de serie pelo index¬∂

In [14]:
serie1[["Brasil"]]

Brasil    1
dtype: int64

In [15]:
serie1[["Brasil", "Isl√¢ndia"]]

Brasil      1
Isl√¢ndia    3
dtype: int64

## 3. dataframe

### 1. Cria√ß√£o de um dataframe

In [18]:
dataframe = pd.DataFrame(np.random.randn(5, 4), index=["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [19]:
type(dataframe)

pandas.DataFrame

### 2. Sele√ß√£o de uma serie no dataframe

In [20]:
dataframe["W"]

A    0.522926
B    0.077859
C   -0.348287
D   -0.225386
E    1.278020
Name: W, dtype: float64

In [21]:
type(dataframe["W"])

pandas.Series

### 3. Sele√ß√£o de uma serie no formato dataframe

In [22]:
dataframe[["W"]]

          W
A  0.522926
B  0.077859
C -0.348287
D -0.225386
E  1.278020

In [23]:
type(dataframe[["W"]])

pandas.DataFrame

### 4. Sele√ß√£o de m√∫ltiplas series

In [24]:
dataframe[["W", "X"]]

          W         X
A  0.522926 -1.176709
B  0.077859 -0.239699
C -0.348287 -0.490559
D -0.225386 -0.847533
E  1.278020  1.744165

In [25]:
type(dataframe[["W", "X"]])

pandas.DataFrame

### 5. Cria√ß√£o de uma coluna que √© a c√≥pia de uma coluna j√° existente

In [26]:
dataframe["new"] = dataframe["W"]

### 6. Cria√ß√£o de uma coluna que √© a soma de outras duas

In [27]:
dataframe["sum"] = dataframe["W"] + dataframe["X"]

### 7. Remo√ß√£o de uma coluna

In [29]:
dataframe.head(1)

          W         X         Y         Z       new       sum
A  0.522926 -1.176709  1.657925 -1.235896  0.522926 -0.653783

In [31]:
dataframe.drop("new", axis=1)

          W         X         Y         Z       sum
A  0.522926 -1.176709  1.657925 -1.235896 -0.653783
B  0.077859 -0.239699  0.997769  0.405365 -0.161840
C -0.348287 -0.490559  0.245674  0.107159 -0.838847
D -0.225386 -0.847533  0.260215  1.216587 -1.072919
E  1.278020  1.744165 -2.279521  1.049704  3.022185

### 8. Remo√ß√£o de uma coluna no dataframe definitivamente

In [32]:
dataframe.drop("sum", axis=1, inplace=True)

In [33]:
dataframe.head(1)

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926

### 9. Loc

In [34]:
dataframe

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926
B  0.077859 -0.239699  0.997769  0.405365  0.077859
C -0.348287 -0.490559  0.245674  0.107159 -0.348287
D -0.225386 -0.847533  0.260215  1.216587 -0.225386
E  1.278020  1.744165 -2.279521  1.049704  1.278020

In [38]:
dataframe.loc["A"]

W      0.522926
X     -1.176709
Y      1.657925
Z     -1.235896
new    0.522926
Name: A, dtype: float64

In [39]:
dataframe.loc[["A"]]

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926

In [40]:
dataframe.loc[["A", "B"]]

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926
B  0.077859 -0.239699  0.997769  0.405365  0.077859

In [42]:
dataframe.loc[["A", "B"], ["Z", "new"]]

          Z       new
A -1.235896  0.522926
B  0.405365  0.077859

### 10. Iloc

In [43]:
dataframe

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926
B  0.077859 -0.239699  0.997769  0.405365  0.077859
C -0.348287 -0.490559  0.245674  0.107159 -0.348287
D -0.225386 -0.847533  0.260215  1.216587 -0.225386
E  1.278020  1.744165 -2.279521  1.049704  1.278020

In [44]:
dataframe.iloc[3, 2]

np.float64(0.26021522464084446)

In [45]:
dataframe.iloc[0, 0]

np.float64(0.5229262199907984)

In [46]:
dataframe.iloc[:-1, :]

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926
B  0.077859 -0.239699  0.997769  0.405365  0.077859
C -0.348287 -0.490559  0.245674  0.107159 -0.348287
D -0.225386 -0.847533  0.260215  1.216587 -0.225386

In [47]:
dataframe.iloc[:-2, 1:]

          X         Y         Z       new
A -1.176709  1.657925 -1.235896  0.522926
B -0.239699  0.997769  0.405365  0.077859
C -0.490559  0.245674  0.107159 -0.348287

### 11. Filtros

In [48]:
dataframe

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926
B  0.077859 -0.239699  0.997769  0.405365  0.077859
C -0.348287 -0.490559  0.245674  0.107159 -0.348287
D -0.225386 -0.847533  0.260215  1.216587 -0.225386
E  1.278020  1.744165 -2.279521  1.049704  1.278020

In [49]:
dataframe > 0

       W      X      Y      Z    new
A   True  False   True  False   True
B   True  False   True   True   True
C  False  False   True   True  False
D  False  False   True   True  False
E   True   True  False   True   True

In [50]:
dataframe[dataframe > 0]

          W         X         Y         Z       new
A  0.522926       NaN  1.657925       NaN  0.522926
B  0.077859       NaN  0.997769  0.405365  0.077859
C       NaN       NaN  0.245674  0.107159       NaN
D       NaN       NaN  0.260215  1.216587       NaN
E  1.278020  1.744165       NaN  1.049704  1.278020

In [51]:
dataframe[(dataframe["W"] > 0) & (dataframe["X"] > 0)]

         W         X         Y         Z      new
E  1.27802  1.744165 -2.279521  1.049704  1.27802

## 4. √çndices

### 1. Cria√ß√£o de um dataframe

In [140]:
dataframe = pd.DataFrame(np.random.randn(5, 4), index=["A", "B", "C", "D", "E"], columns="W X Y Z".split())

### 2. Opera√ß√µes com √≠ndices

In [141]:
dataframe

          W         X         Y         Z
A  0.241357  1.520590 -0.025047  1.197071
B -0.340115  3.023780 -0.559659  0.019265
C  0.426270  0.204738 -2.031136 -0.714616
D  0.763106  0.723236  0.238257 -0.388922
E -1.795623 -0.003906  1.418578  0.227399

In [142]:
dataframe.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='str')

In [143]:
dataframe.columns

Index(['W', 'X', 'Y', 'Z'], dtype='str')

In [144]:
dataframe.reset_index()

  index         W         X         Y         Z
0     A  0.241357  1.520590 -0.025047  1.197071
1     B -0.340115  3.023780 -0.559659  0.019265
2     C  0.426270  0.204738 -2.031136 -0.714616
3     D  0.763106  0.723236  0.238257 -0.388922
4     E -1.795623 -0.003906  1.418578  0.227399

In [145]:
novo_index = "MA PI BA RO RN".split()

In [61]:
dataframe["index"] = novo_index

In [62]:
dataframe

          W         X         Y         Z index
A  1.021567  0.014561  0.217504 -0.578186    MA
B  0.498543 -0.530412 -1.692473  0.866745    PI
C  1.153215 -0.410350  1.406356 -0.914454    BA
D  2.249367 -0.550883 -1.649351 -0.503446    RO
E  0.155313  0.221904  1.101980  0.182031    RN

In [63]:
dataframe.set_index("index")

              W         X         Y         Z
index
MA     1.021567  0.014561  0.217504 -0.578186
PI     0.498543 -0.530412 -1.692473  0.866745
BA     1.153215 -0.410350  1.406356 -0.914454
RO     2.249367 -0.550883 -1.649351 -0.503446
RN     0.155313  0.221904  1.101980  0.182031

In [64]:
dataframe.reset_index()

  level_0         W         X         Y         Z index
0       A  1.021567  0.014561  0.217504 -0.578186    MA
1       B  0.498543 -0.530412 -1.692473  0.866745    PI
2       C  1.153215 -0.410350  1.406356 -0.914454    BA
3       D  2.249367 -0.550883 -1.649351 -0.503446    RO
4       E  0.155313  0.221904  1.101980  0.182031    RN

In [65]:
dataframe.reset_index().set_index("index")

      level_0         W         X         Y         Z
index
MA          A  1.021567  0.014561  0.217504 -0.578186
PI          B  0.498543 -0.530412 -1.692473  0.866745
BA          C  1.153215 -0.410350  1.406356 -0.914454
RO          D  2.249367 -0.550883 -1.649351 -0.503446
RN          E  0.155313  0.221904  1.101980  0.182031

### 3. √çndices multin√≠veis

In [66]:
outside = ["Mulheres", "Mulheres", "Mulheres", "Homens", "Homens", "Homens"]
inside = ["Filial1", "Filial2", "Filial3", "Filial1", "Filial2", "Filial3", ]
hier_index = list(zip(outside, inside))

In [67]:
hier_index

[('Mulheres', 'Filial1'),
 ('Mulheres', 'Filial2'),
 ('Mulheres', 'Filial3'),
 ('Homens', 'Filial1'),
 ('Homens', 'Filial2'),
 ('Homens', 'Filial3')]

In [68]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [69]:
dataframe2 = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns=["A", "B"])

In [70]:
dataframe2

                         A         B
Mulheres Filial1  0.178988 -0.547287
         Filial2  0.788768  1.004817
         Filial3 -2.055019 -1.228565
Homens   Filial1  0.188112  1.091009
         Filial2 -0.616408 -0.302199
         Filial3  2.982007 -0.420618

In [72]:
dataframe2.loc["Mulheres"]

                A         B
Filial1  0.178988 -0.547287
Filial2  0.788768  1.004817
Filial3 -2.055019 -1.228565

In [73]:
dataframe2.loc["Mulheres"].loc["Filial1"]

A    0.178988
B   -0.547287
Name: Filial1, dtype: float64

In [74]:
dataframe2.index

MultiIndex([('Mulheres', 'Filial1'),
            ('Mulheres', 'Filial2'),
            ('Mulheres', 'Filial3'),
            (  'Homens', 'Filial1'),
            (  'Homens', 'Filial2'),
            (  'Homens', 'Filial3')],
           )

In [75]:
dataframe2.index.names

FrozenList([None, None])

In [76]:
dataframe2.index.names = ["Grupo", "Filial"]

In [77]:
dataframe2

                         A         B
Grupo    Filial
Mulheres Filial1  0.178988 -0.547287
         Filial2  0.788768  1.004817
         Filial3 -2.055019 -1.228565
Homens   Filial1  0.188112  1.091009
         Filial2 -0.616408 -0.302199
         Filial3  2.982007 -0.420618

In [78]:
dataframe2.xs("Filial1", level="Filial")

                 A         B
Grupo
Mulheres  0.178988 -0.547287
Homens    0.188112  1.091009

## 5. Tratamento de dados

### 1. Cria√ß√£o de um dataframe

In [146]:
dataframe = pd.DataFrame({ "A": [1, np.nan, 2],
                           "B": [5, np.nan, np.nan],
                           "C": [1, 2, 3]})

In [147]:
dataframe

     A    B  C
0  1.0  5.0  1
1  NaN  NaN  2
2  2.0  NaN  3

### 2. Tratamento de dados ausentes

In [5]:
dataframe.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
dataframe.dropna(axis=1)

   C
0  1
1  2
2  3

In [7]:
dataframe.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  NaN  2
2  2.0  3

In [8]:
dataframe.fillna("Valor")

       A      B  C
0    1.0    5.0  1
1  Valor  Valor  2
2    2.0  Valor  3

In [148]:
dataframe["A"].fillna(value=dataframe["A"].mean())

0    1.0
1    1.5
2    2.0
Name: A, dtype: float64

In [149]:
dataframe

     A    B  C
0  1.0  5.0  1
1  NaN  NaN  2
2  2.0  NaN  3

In [11]:
dataframe.ffill()

     A    B  C
0  1.0  5.0  1
1  1.0  5.0  2
2  2.0  5.0  3

In [12]:
dataframe.bfill()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  2.0  NaN  3

## 6. Group by

### 1. Cria√ß√£o do dataframe

In [16]:
data = pd.DataFrame({ "Classe": ["J√∫nior", "J√∫nior", "Pleno", "Pleno", "S√™nior", "S√™nior"], 
                      "Nome": ["Jorge", "Carlos", "Roberta", "Mariana", "Alice", "Juliana"],
                      "Venda": [200, 120, 340, 124, 243, 350]})

In [17]:
data

   Classe     Nome  Venda
0  J√∫nior    Jorge    200
1  J√∫nior   Carlos    120
2   Pleno  Roberta    340
3   Pleno  Mariana    124
4  S√™nior    Alice    243
5  S√™nior  Juliana    350

### 2. Agrupamentos

In [18]:
data.groupby("Classe")["Venda"].sum()

Classe
J√∫nior    320
Pleno     464
S√™nior    593
Name: Venda, dtype: int64

In [19]:
data.groupby("Classe").sum(numeric_only=True)

        Venda
Classe
J√∫nior    320
Pleno     464
S√™nior    593

In [20]:
data.groupby("Classe").mean(numeric_only=True)

        Venda
Classe
J√∫nior  160.0
Pleno   232.0
S√™nior  296.5

In [21]:
data.groupby("Classe").min()

           Nome  Venda
Classe
J√∫nior   Carlos    120
Pleno   Mariana    124
S√™nior    Alice    243

In [22]:
data.groupby("Classe").max()

           Nome  Venda
Classe
J√∫nior    Jorge    200
Pleno   Roberta    340
S√™nior  Juliana    350

In [25]:
dataframe = data.copy()

In [26]:
data

   Classe     Nome  Venda
0  J√∫nior    Jorge    200
1  J√∫nior   Carlos    120
2   Pleno  Roberta    340
3   Pleno  Mariana    124
4  S√™nior    Alice    243
5  S√™nior  Juliana    350

In [27]:
dataframe

   Classe     Nome  Venda
0  J√∫nior    Jorge    200
1  J√∫nior   Carlos    120
2   Pleno  Roberta    340
3   Pleno  Mariana    124
4  S√™nior    Alice    243
5  S√™nior  Juliana    350

In [28]:
dataframe["Venda"] = [150, 432, 190, 230, 410, 155]

In [29]:
dataframe

   Classe     Nome  Venda
0  J√∫nior    Jorge    150
1  J√∫nior   Carlos    432
2   Pleno  Roberta    190
3   Pleno  Mariana    230
4  S√™nior    Alice    410
5  S√™nior  Juliana    155

In [30]:
data

   Classe     Nome  Venda
0  J√∫nior    Jorge    200
1  J√∫nior   Carlos    120
2   Pleno  Roberta    340
3   Pleno  Mariana    124
4  S√™nior    Alice    243
5  S√™nior  Juliana    350

In [31]:
dataframe2 = pd.concat([data, dataframe])

In [32]:
dataframe2

   Classe     Nome  Venda
0  J√∫nior    Jorge    200
1  J√∫nior   Carlos    120
2   Pleno  Roberta    340
3   Pleno  Mariana    124
4  S√™nior    Alice    243
5  S√™nior  Juliana    350
0  J√∫nior    Jorge    150
1  J√∫nior   Carlos    432
2   Pleno  Roberta    190
3   Pleno  Mariana    230
4  S√™nior    Alice    410
5  S√™nior  Juliana    155

In [33]:
dataframe2.groupby(["Classe", "Nome"]).min()

                Venda
Classe Nome
J√∫nior Carlos     120
       Jorge      150
Pleno  Mariana    124
       Roberta    190
S√™nior Alice      243
       Juliana    155

In [34]:
dataframe2.groupby(["Classe", "Nome"]).max()

                Venda
Classe Nome
J√∫nior Carlos     432
       Jorge      200
Pleno  Mariana    230
       Roberta    340
S√™nior Alice      410
       Juliana    350

In [35]:
dataframe2.groupby(["Classe", "Nome"]).sum()

                Venda
Classe Nome
J√∫nior Carlos     552
       Jorge      350
Pleno  Mariana    354
       Roberta    530
S√™nior Alice      653
       Juliana    505

In [36]:
dataframe2.groupby(["Classe", "Nome"]).mean()

                Venda
Classe Nome
J√∫nior Carlos   276.0
       Jorge    175.0
Pleno  Mariana  177.0
       Roberta  265.0
S√™nior Alice    326.5
       Juliana  252.5

## 7. Merge e concat

### 1. Concat

In [39]:
df1 = pd.DataFrame({"A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"]},
        index = [0, 1, 2, 3])

In [40]:
df2 = pd.DataFrame({"A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"]},
        index = [4, 5, 6, 7])

In [41]:
df3 = pd.DataFrame({"A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"]},
        index = [8, 9, 10, 11])

In [42]:
df4 = pd.DataFrame({"A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"]},
        index = [0, 1, 2, 3])

In [43]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [44]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [45]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [46]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [47]:
pd.concat([df1, df4], axis=1)

    A   B   C   D    A    B    C    D
0  A0  B0  C0  D0   A8   B8   C8   D8
1  A1  B1  C1  D1   A9   B9   C9   D9
2  A2  B2  C2  D2  A10  B10  C10  D10
3  A3  B3  C3  D3  A11  B11  C11  D11

In [48]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### 2. Merge

In [49]:
esquerda = pd.DataFrame({"key": ["k0", "k1", "k2", "k3"],
                         "A": ["A0", "A1", "A2", "A3"],
                         "B": ["B0", "B1", "B2", "B3"]})
direita = pd.DataFrame({"key": ["k0", "k1", "k2", "k3"],
                         "C": ["C0", "C1", "C2", "C3"],
                         "D": ["D0", "D1", "D2", "D3"]})

In [50]:
esquerda

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [51]:
direita

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [52]:
pd.merge(esquerda, direita, on="key")

  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

In [53]:
esquerda = pd.DataFrame({"key1": ["k0", "k0", "k1", "k2"],
                         "key2": ["k0", "k1", "k0", "k1"],
                         "A": ["A0", "A1", "A2", "A3"],
                         "B": ["B0", "B1", "B2", "B3"]})
direita = pd.DataFrame({"key1": ["k0", "k1", "k1", "k2"],
                        "key2": ["k0", "k0", "k0", "k0"],
                         "C": ["C0", "C1", "C2", "C3"],
                         "D": ["D0", "D1", "D2", "D3"]})

In [54]:
esquerda

  key1 key2   A   B
0   k0   k0  A0  B0
1   k0   k1  A1  B1
2   k1   k0  A2  B2
3   k2   k1  A3  B3

In [55]:
direita

  key1 key2   C   D
0   k0   k0  C0  D0
1   k1   k0  C1  D1
2   k1   k0  C2  D2
3   k2   k0  C3  D3

In [56]:
pd.merge(esquerda, direita, on=["key1", "key2"])

  key1 key2   A   B   C   D
0   k0   k0  A0  B0  C0  D0
1   k1   k0  A2  B2  C1  D1
2   k1   k0  A2  B2  C2  D2

In [57]:
pd.merge(esquerda, direita,how="left", on=["key1", "key2"])

  key1 key2   A   B    C    D
0   k0   k0  A0  B0   C0   D0
1   k0   k1  A1  B1  NaN  NaN
2   k1   k0  A2  B2   C1   D1
3   k1   k0  A2  B2   C2   D2
4   k2   k1  A3  B3  NaN  NaN

In [58]:
pd.merge(esquerda, direita, how="right", on=["key1", "key2"])

  key1 key2    A    B   C   D
0   k0   k0   A0   B0  C0  D0
1   k1   k0   A2   B2  C1  D1
2   k1   k0   A2   B2  C2  D2
3   k2   k0  NaN  NaN  C3  D3

In [59]:
pd.merge(esquerda, direita, how="outer", on=["key1", "key2"])

  key1 key2    A    B    C    D
0   k0   k0   A0   B0   C0   D0
1   k0   k1   A1   B1  NaN  NaN
2   k1   k0   A2   B2   C1   D1
3   k1   k0   A2   B2   C2   D2
4   k2   k0  NaN  NaN   C3   D3
5   k2   k1   A3   B3  NaN  NaN

### 3. Join

In [60]:
esquerda = pd.DataFrame({ "A": ["A0", "A1", "A2"],
                          "B": ["B0", "B1", "B2"]},
                        index=["k0", "k1", "k2"])

direita = pd.DataFrame({ "C": ["C0", "C2", "C3"],
                          "D": ["Dd0", "D2", "D3"]},
                        index=["k0", "k2", "k3"])

In [61]:
esquerda

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [62]:
direita

     C    D
k0  C0  Dd0
k2  C2   D2
k3  C3   D3

In [63]:
esquerda.join(direita)

     A   B    C    D
k0  A0  B0   C0  Dd0
k1  A1  B1  NaN  NaN
k2  A2  B2   C2   D2

In [64]:
esquerda.join(direita, how="outer")

      A    B    C    D
k0   A0   B0   C0  Dd0
k1   A1   B1  NaN  NaN
k2   A2   B2   C2   D2
k3  NaN  NaN   C3   D3

## 8. Opera√ß√µes com dataframes

### 1. Cria√ß√£o do dataframe

In [66]:
df = pd.DataFrame({"col1": [1, 2, 3, 4],
                   "col2": [444, 555, 666, 444],
                   "col3": ["abc", "def", "ghi", "xyz"]})

### 2. Coletar informa√ß√£o do dataframe

In [67]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [68]:
df.tail()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [69]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [70]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='str')

In [71]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [72]:
df.sort_values(by="col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [73]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      str
dtypes: int64(2), str(1)
memory usage: 228.0 bytes

In [74]:
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

### 3. Verificar unicidade

In [75]:
df["col2"].unique()

array([444, 555, 666])

In [76]:
df["col2"].nunique()

3

In [77]:
df["col2"].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

### 4. Fun√ß√µes lambda

In [78]:
df = pd.DataFrame({"col1": [1, 2, 3, 4],
                   "col2": [444, 555, 666, 444],
                   "col3": ["abc", "def", "ghi", "xyz"]})

In [79]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [80]:
def calc(x):
    return x ** 2 + 4

In [81]:
df["col1"].apply(calc)

0     5
1     8
2    13
3    20
Name: col1, dtype: int64

In [82]:
df["calculus"] = df["col1"].apply(calc)

In [83]:
df

   col1  col2 col3  calculus
0     1   444  abc         5
1     2   555  def         8
2     3   666  ghi        13
3     4   444  xyz        20

In [84]:
df["col1"].apply(lambda x: x ** 2 + 4)

0     5
1     8
2    13
3    20
Name: col1, dtype: int64

In [85]:
df["calc_lambda"] = df["col1"].apply(lambda x: x ** 2 + 4)

In [86]:
df

   col1  col2 col3  calculus  calc_lambda
0     1   444  abc         5            5
1     2   555  def         8            8
2     3   666  ghi        13           13
3     4   444  xyz        20           20

### 5. Fun√ß√µes matem√°ticas

In [97]:
df["col1"].sum()

np.int64(10)

In [98]:
df["col1"].mean()

np.float64(2.5)

In [99]:
df["col1"].product()

np.int64(24)

In [100]:
df["col1"].std()

np.float64(1.2909944487358056)

In [101]:
df["col1"].max()

np.int64(4)

In [102]:
df["col1"].min()

np.int64(1)

In [103]:
df["col1"].idxmax()

3

In [104]:
df["col1"].idxmin()

0

### 6. Dataframes

In [107]:
df = pd.DataFrame({"col1": [1, 2, 3, 4],
                   "col2": [444, 555, 666, 444],
                   "col3": ["abc", "def", "ghi", "xyz"]})

In [108]:
df[df["col2"] == 444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [109]:
df[df["col2"] == 444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [110]:
data = {
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1, 3, 2, 5, 4, 1]
}

dataframe = pd.DataFrame(data)

In [111]:
dataframe

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [112]:
dict_map = {"one": 1, "two": 2}

In [113]:
dataframe["C"] = dataframe["B"].map(dict_map)

In [114]:
dataframe

     A    B  C  D
0  foo  one  1  1
1  foo  one  1  3
2  foo  two  2  2
3  bar  two  2  5
4  bar  one  1  4
5  bar  one  1  1

In [115]:
dataframe.pivot_table(index="A", columns="B", values="D")

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0

## 9. Series temporais

Series temporais s√£o conjuntos de dados coletados de forma sequencial ao longo de tempo, geralmente em intervalos rgulares (dia, hora, minuto). Essas series s√£o muito usadas na √°rea de finan√ßas para analisar padr√µes, tend√™ncias e prever o futuro.

In [116]:
numero_de_dias = 100

In [117]:
datas = pd.date_range(start="1/1/2024", periods=numero_de_dias)

In [118]:
type(datas)

pandas.DatetimeIndex

In [119]:
dataframe = pd.DataFrame(range(numero_de_dias), columns=["number"], index=datas)

In [120]:
dataframe

            number
2024-01-01       0
2024-01-02       1
2024-01-03       2
2024-01-04       3
2024-01-05       4
...            ...
2024-04-05      95
2024-04-06      96
2024-04-07      97
2024-04-08      98
2024-04-09      99

[100 rows x 1 columns]

In [121]:
dataframe.index

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10', '2024-01-11', '2024-01-12',
               '2024-01-13', '2024-01-14', '2024-01-15', '2024-01-16',
               '2024-01-17', '2024-01-18', '2024-01-19', '2024-01-20',
               '2024-01-21', '2024-01-22', '2024-01-23', '2024-01-24',
               '2024-01-25', '2024-01-26', '2024-01-27', '2024-01-28',
               '2024-01-29', '2024-01-30', '2024-01-31', '2024-02-01',
               '2024-02-02', '2024-02-03', '2024-02-04', '2024-02-05',
               '2024-02-06', '2024-02-07', '2024-02-08', '2024-02-09',
               '2024-02-10', '2024-02-11', '2024-02-12', '2024-02-13',
               '2024-02-14', '2024-02-15', '2024-02-16', '2024-02-17',
               '2024-02-18', '2024-02-19', '2024-02-20', '2024-02-21',
               '2024-02-22', '2024-02-23', '2024-02-24', '2024-02-25',
               '2024-02-26', '2024-02-27', '2024-02-28', '2024-02-29',
               '2024-03-01', '2024-03-02', '2024-03-03', '2024-03-04',
               '2024-03-05', '2024-03-06', '2024-03-07', '2024-03-08',
               '2024-03-09', '2024-03-10', '2024-03-11', '2024-03-12',
               '2024-03-13', '2024-03-14', '2024-03-15', '2024-03-16',
               '2024-03-17', '2024-03-18', '2024-03-19', '2024-03-20',
               '2024-03-21', '2024-03-22', '2024-03-23', '2024-03-24',
               '2024-03-25', '2024-03-26', '2024-03-27', '2024-03-28',
               '2024-03-29', '2024-03-30', '2024-03-31', '2024-04-01',
               '2024-04-02', '2024-04-03', '2024-04-04', '2024-04-05',
               '2024-04-06', '2024-04-07', '2024-04-08', '2024-04-09'],
              dtype='datetime64[us]', freq='D')

In [122]:
dataframe.index[0]

Timestamp('2024-01-01 00:00:00')

In [123]:
dataframe.index[2].day

3

In [124]:
dataframe.index[3].month

1

In [125]:
dataframe.index[3].year

2024

In [126]:
dataframe[dataframe.index.month == 4]

            number
2024-04-01      91
2024-04-02      92
2024-04-03      93
2024-04-04      94
2024-04-05      95
2024-04-06      96
2024-04-07      97
2024-04-08      98
2024-04-09      99

In [127]:
dataframe[dataframe.index.day == 2]

            number
2024-01-02       1
2024-02-02      32
2024-03-02      61
2024-04-02      92

In [130]:
dataframe[dataframe.index > datetime.datetime(2024, 3, 30)]

            number
2024-03-31      90
2024-04-01      91
2024-04-02      92
2024-04-03      93
2024-04-04      94
2024-04-05      95
2024-04-06      96
2024-04-07      97
2024-04-08      98
2024-04-09      99

## 10. Entrada e sa√≠da de dados

### 1. Entrada de dados csv e tsv

In [131]:
heart_df= pd.read_csv("Heart_Disease_Prediction.csv", sep=",")

### 2. Sa√≠da de dados csv e tsv

In [134]:
heart_df.to_csv("heart_df.csv", sep=",")

### 3. Entrada de dados excel

In [135]:
# Bibliotecas para trabalhar com excel
!pip install xlrd 
!pip install openpyxl

Requirement already satisfied: xlrd in /home/mariana/Documentos/data-science-studies/venv/lib/python3.13/site-packages (2.0.2)
Requirement already satisfied: openpyxl in /home/mariana/Documentos/data-science-studies/venv/lib/python3.13/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /home/mariana/Documentos/data-science-studies/venv/lib/python3.13/site-packages (from openpyxl) (2.0.0)

In [ ]:
pd.read_excel("arquivo_excel.xlsx", sheet_name="sheet1")

### 4. Sa√≠da de dados excel

In [ ]:
pd.to_excel("arquivo_excel.xlsx", sheet_name="sheet1")